[Survived] BooleanLiteral
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemForm.js:59:75
                             id="diningCommonsCode"
                             type="text"
                             isInvalid={Boolean(errors.quarterYYYYQ)}
-                            {...register("diningCommonsCode", { required: true })}
+                            {...register("diningCommonsCode", { required: false })}
                         />
                         <Form.Control.Feedback type="invalid">

[Survived] ObjectLiteral
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemForm.js:59:63
                             id="diningCommonsCode"
                             type="text"
                             isInvalid={Boolean(errors.quarterYYYYQ)}
-                            {...register("diningCommonsCode", { required: true })}
+                            {...register("diningCommonsCode", {})}
                         />
                         <Form.Control.Feedback type="invalid">

[Survived] LogicalOperator
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemForm.js:62:30
                             {...register("diningCommonsCode", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.quarterYYYYQ && ' Dining Common Code is required. '}
+                            {errors.quarterYYYYQ || ' Dining Common Code is required. '}
                         </Form.Control.Feedback>
                     </Form.Group>

[Survived] ConditionalExpression
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemForm.js:62:30
                             {...register("diningCommonsCode", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.quarterYYYYQ && ' Dining Common Code is required. '}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>

[Survived] BooleanLiteral
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemForm.js:74:62
                             id="name"
                             type="text"
                             isInvalid={Boolean(errors.localDateTime)}
-                            {...register("name", { required: true })}
+                            {...register("name", { required: false })}
                         />
                         <Form.Control.Feedback type="invalid">

[Survived] StringLiteral
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemForm.js:74:42
                             id="name"
                             type="text"
                             isInvalid={Boolean(errors.localDateTime)}
-                            {...register("name", { required: true })}
+                            {...register("", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">

[Survived] ConditionalExpression
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemForm.js:77:30
                             {...register("name", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.localDateTime && ' Dish Name is required. '}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>

[Survived] LogicalOperator
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemForm.js:77:30
                             {...register("name", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.localDateTime && ' Dish Name is required. '}
+                            {errors.localDateTime || ' Dish Name is required. '}
                         </Form.Control.Feedback>
                     </Form.Group>
