[Killed] LogicalOperator
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemForm.js:35:18
 
             <Row>
 
-                {initialContents && (
-                    <Col>
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">Id</Form.Label>
-                            <Form.Control
-                                data-testid="UCSBMenuItemForm-id"
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialContents.id}
-                                disabled
-                            />
-                        </Form.Group>
-                    </Col>
-                )}
+                {initialContents || <Col>
+                        <Form.Group className="mb-3">
+                            <Form.Label htmlFor="id">Id</Form.Label>
+                            <Form.Control data-testid="UCSBMenuItemForm-id" id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+                        </Form.Group>
+                    </Col>}
 
                 <Col>
killedBy: UCSBMenuItemForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemForm.js:35:18
 
             <Row>
 
-                {initialContents && (
-                    <Col>
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">Id</Form.Label>
-                            <Form.Control
-                                data-testid="UCSBMenuItemForm-id"
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialContents.id}
-                                disabled
-                            />
-                        </Form.Group>
-                    </Col>
-                )}
+                {true}
 
                 <Col>
killedBy: UCSBMenuItemForm tests renders correctly when passing in a UCSBMenuItem
statusReason: Error: Unable to find an element by: [data-testid="/UCSBMenuItemForm-id/"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemForm.js:60:43
                             type="text"
                             isInvalid={Boolean(errors.name)}
                             {...register("dccode", {
-                                required: "Dining Common Code is required.",
+                                required: "",
                                 maxLength : {
                                     value: 30,
killedBy: UCSBMenuItemForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /Dining Common Code is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] OptionalChaining
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemForm.js:68:30
                             })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.dccode?.message}
+                            {errors.dccode.message}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: UCSBMenuItemForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemForm.js:105:42
                             id="station"
                             type="text"
                             isInvalid={Boolean(errors.name)}
-                            {...register("station", {
+                            {...register("", {
                                 required: "Dining Common Station is required."
                             })}
killedBy: UCSBMenuItemForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')
