[Survived] BlockStatement
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemTable.js:13:36
 
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        navigate(`/ucsbmenuitems/edit/${cell.row.values.id}`)
-    }
+    const editCallback = (cell) => {}
 
     // Stryker disable all : hard to test for query caching

[Survived] StringLiteral
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemTable.js:14:18
     const navigate = useNavigate();
 
     const editCallback = (cell) => {
-        navigate(`/ucsbmenuitems/edit/${cell.row.values.id}`)
+        navigate(``)
     }
 

[Survived] ObjectLiteral
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemTable.js:35:9
             Header: 'id',
             accessor: 'id', // accessor is the "key" in the data
         },
-        {
-            Header: 'Dining Common Code',
-            accessor: 'diningCommonsCode',
-        },
+        {},
         {
             Header: 'Name',

[Survived] BlockStatement
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemTable.js:49:45
         }
     ];
 
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-        columns.push(ButtonColumn("Edit", "primary", editCallback, "UCSBMenuItemsTable"));
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, "UCSBMenuItemsTable"));
-    } 
+    if (hasRole(currentUser, "ROLE_ADMIN")) {} 
 
     return <OurTable

[Survived] StringLiteral
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemTable.js:50:68
     ];
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
-        columns.push(ButtonColumn("Edit", "primary", editCallback, "UCSBMenuItemsTable"));
+        columns.push(ButtonColumn("Edit", "primary", editCallback, ""));
         columns.push(ButtonColumn("Delete", "danger", deleteCallback, "UCSBMenuItemsTable"));
     } 

[Survived] StringLiteral
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemTable.js:51:35
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
         columns.push(ButtonColumn("Edit", "primary", editCallback, "UCSBMenuItemsTable"));
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, "UCSBMenuItemsTable"));
+        columns.push(ButtonColumn("", "danger", deleteCallback, "UCSBMenuItemsTable"));
     } 
 

[Survived] StringLiteral
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemTable.js:51:45
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
         columns.push(ButtonColumn("Edit", "primary", editCallback, "UCSBMenuItemsTable"));
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, "UCSBMenuItemsTable"));
+        columns.push(ButtonColumn("Delete", "", deleteCallback, "UCSBMenuItemsTable"));
     } 
 
