[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewsForm.js:5:77
 import { useForm } from 'react-hook-form'
 import { useNavigate } from 'react-router-dom'
 
-function MenuItemReviewsForm({ initialContents, submitAction, buttonLabel = "Create" }) {
+function MenuItemReviewsForm({ initialContents, submitAction, buttonLabel = "" }) {
 
     // Stryker disable all
killedBy: MenuItemReviewsForm tests renders correctly with no initialContents
statusReason: Error: Unable to find an element with the text: /Create/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/MenuItemReviews/MenuItemReviewsForm.js:35:18
 
             <Row>
 
-                {initialContents && (
-                    <Col>
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">Id</Form.Label>
-                            <Form.Control
-                                data-testid="MenuItemReviewsForm-id"
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialContents.id}
-                                disabled
-                            />
-                        </Form.Group>
-                    </Col>
-                )}
+                {true}
 
                 <Col>
killedBy: MenuItemReviewsForm tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="MenuItemReviewsForm-id"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/MenuItemReviews/MenuItemReviewsForm.js:35:18
 
             <Row>
 
-                {initialContents && (
-                    <Col>
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">Id</Form.Label>
-                            <Form.Control
-                                data-testid="MenuItemReviewsForm-id"
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialContents.id}
-                                disabled
-                            />
-                        </Form.Group>
-                    </Col>
-                )}
+                {initialContents || <Col>
+                        <Form.Group className="mb-3">
+                            <Form.Label htmlFor="id">Id</Form.Label>
+                            <Form.Control data-testid="MenuItemReviewsForm-id" id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+                        </Form.Group>
+                    </Col>}
 
                 <Col>
killedBy: MenuItemReviewsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Objects are not valid as a React child (found: object with keys {id, itemId, reviewerEmail, stars, dateReviewed, comments}). If you meant to render a collection of children, use an array instead.

[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewsForm.js:93:46
                                 required: "stars is required. Must be an integer from 1 to 5.",
                                 max: {
                                     value: 5,
-                                    message: "Max 5"
+                                    message: ""
                                 },
                                 min: {
killedBy: MenuItemReviewsForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Max 5/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewsForm.js:114:42
                             id="comments"
                             type="text"
                             isInvalid={Boolean(errors.comments)}
-                            {...register("comments", { required: "comments is required." })}
+                            {...register("", { required: "comments is required." })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewsForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')
