[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewsTable.js:45:23
         },
         {
             Header: 'stars',
-            accessor: 'stars',
+            accessor: "",
         },
         {
killedBy: MenuItemReviewsTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  5
Received:

[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewsTable.js:49:23
         },
         {
             Header: 'comments',
-            accessor: 'comments',
+            accessor: "",
         },
         {
killedBy: MenuItemReviewsTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Best roast beef I have ever had
Received:

[Killed] ObjectLiteral
main/components/MenuItemReviews/MenuItemReviewsTable.js:51:9
             Header: 'comments',
             accessor: 'comments',
         },
-        {
-            Header: 'dateReviewed',
-            accessor: 'dateReviewed',
-        }
+        {}
     ];
 
killedBy: MenuItemReviewsTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!
