[Killed] ArrowFunction
main/pages/MenuItemReviews/MenuItemReviewsCreatePage.js:9:31
 
 export default function MenuItemReviewsCreatePage({ storybook = false }) {
 
-  const objectToAxiosParams = (menuItemReviews) => ({
-    url: "/api/menuitemreviews/post",
-    method: "POST",
-    params: {
-      itemId: menuItemReviews.itemId,
-      reviewerEmail: menuItemReviews.reviewerEmail,
-      stars: menuItemReviews.stars,
-      dateReviewed: menuItemReviews.dateReviewed,
-      comments: menuItemReviews.comments
-    }
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (menuItemReviews) => { 
killedBy: MenuItemReviewsCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/MenuItemReviews/MenuItemReviewsCreatePage.js:9:53
 
 export default function MenuItemReviewsCreatePage({ storybook = false }) {
 
-  const objectToAxiosParams = (menuItemReviews) => ({
-    url: "/api/menuitemreviews/post",
-    method: "POST",
-    params: {
-      itemId: menuItemReviews.itemId,
-      reviewerEmail: menuItemReviews.reviewerEmail,
-      stars: menuItemReviews.stars,
-      dateReviewed: menuItemReviews.dateReviewed,
-      comments: menuItemReviews.comments
-    }
-  });
+  const objectToAxiosParams = (menuItemReviews) => ({});
 
   const onSuccess = (menuItemReviews) => { 
killedBy: MenuItemReviewsCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/pages/MenuItemReviews/MenuItemReviewsCreatePage.js:21:42
     }
   });
 
-  const onSuccess = (menuItemReviews) => { 
-    toast(`New menuItemReviews Created - id: ${menuItemReviews.id} itemId: ${menuItemReviews.itemId}  stars: ${menuItemReviews.stars}`);
-  }
+  const onSuccess = (menuItemReviews) => {}
 
   const mutation = useBackendMutation(
killedBy: MenuItemReviewsCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New menuItemReviews Created - id: 1 itemId: 10  stars: 1"

Number of calls: 0

[Killed] BlockStatement
main/pages/MenuItemReviews/MenuItemReviewsCreatePage.js:38:32
     mutation.mutate(data);
   }
 
-  if (isSuccess && !storybook) {
-    return <Navigate to="/menuitemreviews" />
-  }
+  if (isSuccess && !storybook) {}
 
   return (
killedBy: MenuItemReviewsCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/menuitemreviews"}

Number of calls: 0
