[Killed] ArrowFunction
main/pages/MenuItemReviews/MenuItemReviewsEditPage.js:25:34
     );
 
 
-  const objectToAxiosPutParams = (menuItemReviews) => ({ 
-    url: "/api/menuitemreviews",
-    method: "PUT",
-    params: {
-      id: menuItemReviews.id,
-    },
-    data: {
-      itemId: menuItemReviews.itemId,
-      reviewerEmail: menuItemReviews.reviewerEmail,
-      stars: menuItemReviews.stars,
-      dateReviewed: menuItemReviews.dateReviewed,
-      comments: menuItemReviews.comments
-    }
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (menuItemReviews) => {
killedBy: MenuItemReviewsEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New menuItemReviews Created - id: 3 itemId: 20  stars: 4"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
main/pages/MenuItemReviews/MenuItemReviewsEditPage.js:31:11
     params: {
       id: menuItemReviews.id,
     },
-    data: {
-      itemId: menuItemReviews.itemId,
-      reviewerEmail: menuItemReviews.reviewerEmail,
-      stars: menuItemReviews.stars,
-      dateReviewed: menuItemReviews.dateReviewed,
-      comments: menuItemReviews.comments
-    }
+    data: {}
   });
 
killedBy: MenuItemReviewsEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"itemId\":20,\"reviewerEmail\":\"pmanopchantaroj@ucsb.edu\",\"stars\":\"4\",\"dateReviewed\":\"2024-04-04T05:55\",\"comments\":\"One of the better food options here\"}"
Received: "{}"

[Killed] LogicalOperator
main/pages/MenuItemReviews/MenuItemReviewsEditPage.js:66:11
       <div className="pt-2">
         <h1>Edit MenuItemReviews</h1>
         {
-          menuItemReviews && <MenuItemReviewsForm initialContents={menuItemReviews} submitAction={onSubmit} buttonLabel="Update" /> //todo
+          menuItemReviews || <MenuItemReviewsForm initialContents={menuItemReviews} submitAction={onSubmit} buttonLabel="Update" /> //todo //todo
         }
       </div>
killedBy: MenuItemReviewsEditPage tests when the backend doesn't return data renders header but table is not present
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input class="form-control" data-testid="MenuItemReviewsForm-itemId" id="itemId" name="itemId" type="number" /> instead

[Killed] ConditionalExpression
main/pages/MenuItemReviews/MenuItemReviewsEditPage.js:66:11
       <div className="pt-2">
         <h1>Edit MenuItemReviews</h1>
         {
-          menuItemReviews && <MenuItemReviewsForm initialContents={menuItemReviews} submitAction={onSubmit} buttonLabel="Update" /> //todo
+          false //todo
         }
       </div>
killedBy: MenuItemReviewsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="MenuItemReviewsForm-itemId"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
