[Killed] BlockStatement
main/pages/MenuItemReviews/MenuItemReviewsIndexPage.js:13:30
 
   const currentUser = useCurrentUser();
 
-  const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-        return (
-            <Button
-                variant="primary"
-                href="/menuitemreviews/create"
-                style={{ float: "right" }}
-            >
-                Create MenuItemReviews
-            </Button>
-        )
-    } 
-  }
+  const createButton = () => {}
   
   const { data: menuItemReviews, error: _error, status: _status } =
killedBy: MenuItemReviewsIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create MenuItemReviews/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] BlockStatement
main/pages/MenuItemReviews/MenuItemReviewsIndexPage.js:14:45
   const currentUser = useCurrentUser();
 
   const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-        return (
-            <Button
-                variant="primary"
-                href="/menuitemreviews/create"
-                style={{ float: "right" }}
-            >
-                Create MenuItemReviews
-            </Button>
-        )
-    } 
+    if (hasRole(currentUser, "ROLE_ADMIN")) {} 
   }
   
killedBy: MenuItemReviewsIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create MenuItemReviews/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
