[Killed] OptionalChaining
main/components/UCSBOrganizations/UCSBOrganizationsForm.js:35:31
                     {...register("orgCode", {
                         required: "orgCode is required."
                     })}
-                    disabled={initialContents?.orgCode}
+                    disabled={initialContents.orgCode}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganizationsForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'orgCode')

[Killed] ObjectLiteral
main/components/UCSBOrganizations/UCSBOrganizationsForm.js:82:46
                     data-testid={testIdPrefix + "-inactive"}
                     id="inactive"
                     type="boolean"
-                    {...register("inactive", {
-                        required: "inactive is required."
-                    })}
+                    {...register("inactive", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganizationsForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /inactive is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
