[Killed] BlockStatement
main/components/UCSBOrganizations/UCSBOrganizationsTable.js:16:36
 
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        navigate(`/UCSBOrganizations/edit/${cell.row.values.orgCode}`)
-    }
+    const editCallback = (cell) => {}
 
     // Stryker disable all : hard to test for query caching
killedBy: UCSBOrganizationsTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/UCSBOrganizations/edit/SKY"

Number of calls: 0

<html>
  <head />

[Killed] ArrayDeclaration
main/components/UCSBOrganizations/UCSBOrganizationsTable.js:32:21
     // Stryker disable next-line all : TODO try to make a good test for this
     const deleteCallback = async (cell) => { deleteMutation.mutate(cell); }
 
-    const columns = [
-        {
-            Header: 'orgCode',
-            accessor: 'orgCode', // accessor is the "key" in the data
-        },
-
-        {
-            Header: 'orgTranslationShort',
-            accessor: 'orgTranslationShort',
-        },
-        {
-            Header: 'orgTranslation',
-            accessor: 'orgTranslation',
-        },
-        {
-            Header: 'inactive',
-            // id: 'inactive',
-            accessor: key => String(key.inactive),
-        }
-    ];
+    const columns = [];
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
killedBy: UCSBOrganizationsIndexPage tests renders three restaurants correctly for regular user
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationsTable-cell-row-0-col-orgCode"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Survived] ArrowFunction
main/components/UCSBOrganizations/UCSBOrganizationsTable.js:49:23
         {
             Header: 'inactive',
             // id: 'inactive',
-            accessor: key => String(key.inactive),
+            accessor: () => undefined,
         }
     ];
