[Killed] ArrowFunction
main/pages/UCSBOrganizations/UCSBOrganizationsCreatePage.js:9:31
 
 export default function UCSBOrganizationsCreatePage({storybook=false}) {
 
-  const objectToAxiosParams = (UCSBOrganizations) => ({
-    url: "/api/UCSBOrganizations/post",
-    method: "POST",
-    params: {
-     orgCode: UCSBOrganizations.orgCode,
-     orgTranslationShort: UCSBOrganizations.orgTranslationShort,
-     orgTranslation: UCSBOrganizations.orgTranslation,
-     inactive: UCSBOrganizations.inactive
-    }
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (UCSBOrganizations) => {
killedBy: UCSBOrganizationsCreatePage tests on submit, makes request to backend, and redirects to /UCSBOrganizations
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/UCSBOrganizations/UCSBOrganizationsCreatePage.js:10:10
 export default function UCSBOrganizationsCreatePage({storybook=false}) {
 
   const objectToAxiosParams = (UCSBOrganizations) => ({
-    url: "/api/UCSBOrganizations/post",
+    url: "",
     method: "POST",
     params: {
killedBy: UCSBOrganizationsCreatePage tests on submit, makes request to backend, and redirects to /UCSBOrganizations
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New org Created - orgCode: OSLI orgTranslationShort: STUDENT LIFE orgTranslation: OFFICE OF STUDENT LIFE inactive: false"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
main/pages/UCSBOrganizations/UCSBOrganizationsCreatePage.js:12:13
   const objectToAxiosParams = (UCSBOrganizations) => ({
     url: "/api/UCSBOrganizations/post",
     method: "POST",
-    params: {
-     orgCode: UCSBOrganizations.orgCode,
-     orgTranslationShort: UCSBOrganizations.orgTranslationShort,
-     orgTranslation: UCSBOrganizations.orgTranslation,
-     inactive: UCSBOrganizations.inactive
-    }
+    params: {}
   });
 
killedBy: UCSBOrganizationsCreatePage tests on submit, makes request to backend, and redirects to /UCSBOrganizations
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

- Object {
-   "inactive": "false",
-   "orgCode": "OSLI",

[Killed] BlockStatement
main/pages/UCSBOrganizations/UCSBOrganizationsCreatePage.js:37:32
     mutation.mutate(data);
   }
 
-  if (isSuccess && !storybook) {
-    return <Navigate to="/UCSBOrganizations" />
-  }
+  if (isSuccess && !storybook) {}
 
   return (
killedBy: UCSBOrganizationsCreatePage tests on submit, makes request to backend, and redirects to /UCSBOrganizations
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/UCSBOrganizations"}

Number of calls: 0
