[Killed] ObjectLiteral
main/pages/UCSBOrganizations/UCSBOrganizationsEditPage.js:15:13
         useBackend(
             // Stryker disable next-line all : don't test internal caching of React Query
             [`/api/UCSBOrganizations?orgCode=${orgCode}`],
-            {  // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
-                method: "GET",
-                url: `/api/UCSBOrganizations`,
-                params: {
-                    orgCode
-                }
-            }
+            {}
         );
 
killedBy: UCSBOrganizationsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationsForm-orgCode"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/pages/UCSBOrganizations/UCSBOrganizationsEditPage.js:24:36
             }
         );
 
-    const objectToAxiosPutParams = (orgs) => ({
-        url: "/api/UCSBOrganizations",
-        method: "PUT",
-        params: {
-            orgCode: orgs.orgCode,
-        },
-        data: {
-            orgTranslationShort: orgs.orgTranslationShort,
-            orgTranslation: orgs.orgTranslation,
-            inactive: orgs.inactive
-        }
-    });
+    const objectToAxiosPutParams = () => undefined;
 
     const onSuccess = (orgs) => {
killedBy: UCSBOrganizationsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New org Created - orgCode: SKY orgTranslationShort: SKYDIVING CLUB World Class orgTranslation: Really Great SKYDIVING CLUB AT UCSB inactive: true"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] StringLiteral
main/pages/UCSBOrganizations/UCSBOrganizationsEditPage.js:26:17
 
     const objectToAxiosPutParams = (orgs) => ({
         url: "/api/UCSBOrganizations",
-        method: "PUT",
+        method: "",
         params: {
             orgCode: orgs.orgCode,
killedBy: UCSBOrganizationsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New org Created - orgCode: SKY orgTranslationShort: SKYDIVING CLUB World Class orgTranslation: Really Great SKYDIVING CLUB AT UCSB inactive: true"
Received: "New org Created - orgCode: SKY orgTranslationShort: SKYDIVING CLUB orgTranslation: SKYDIVING CLUB AT UCSB inactive: false"

Number of calls: 1

[Killed] BlockStatement
main/pages/UCSBOrganizations/UCSBOrganizationsEditPage.js:37:33
         }
     });
 
-    const onSuccess = (orgs) => {
-        toast(`New org Created - orgCode: ${orgs.orgCode} orgTranslationShort: ${orgs.orgTranslationShort} orgTranslation: ${orgs.orgTranslation} inactive: ${orgs.inactive}`);
-    }
+    const onSuccess = (orgs) => {}
 
     const mutation = useBackendMutation(
killedBy: UCSBOrganizationsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ConditionalExpression
main/pages/UCSBOrganizations/UCSBOrganizationsEditPage.js:63:21
             <div className="pt-2">
                 <h1>Edit UCSBOrganizations</h1>
                 {
-                    orgs && <UCSBOrganizationsForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={orgs} />
+                    false
                 }
             </div>
killedBy: UCSBOrganizationsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationsForm-orgCode"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] LogicalOperator
main/pages/UCSBOrganizations/UCSBOrganizationsEditPage.js:63:21
             <div className="pt-2">
                 <h1>Edit UCSBOrganizations</h1>
                 {
-                    orgs && <UCSBOrganizationsForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={orgs} />
+                    orgs || <UCSBOrganizationsForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={orgs} />
                 }
             </div>
killedBy: UCSBOrganizationsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBOrganizationsForm-orgCode"]

<body>
  <div />
</body>
