[Killed] BlockStatement
main/pages/UCSBOrganizations/UCSBOrganizationsIndexPage.js:22:32
             []
         );
 
-    const createButton = () => {
-        if (hasRole(currentUser, "ROLE_ADMIN")) {
-            return (
-                <Button
-                    variant="primary"
-                    href="/UCSBOrganizations/create"
-                    style={{ float: "right" }}
-                >
-                    Create UCSBOrganizations
-                </Button>
-            )
-        } 
-    }
+    const createButton = () => {}
 
     return (
killedBy: UCSBOrganizationsIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create UCSBOrganizations/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] BlockStatement
main/pages/UCSBOrganizations/UCSBOrganizationsIndexPage.js:23:49
         );
 
     const createButton = () => {
-        if (hasRole(currentUser, "ROLE_ADMIN")) {
-            return (
-                <Button
-                    variant="primary"
-                    href="/UCSBOrganizations/create"
-                    style={{ float: "right" }}
-                >
-                    Create UCSBOrganizations
-                </Button>
-            )
-        } 
+        if (hasRole(currentUser, "ROLE_ADMIN")) {} 
     }
 
killedBy: UCSBOrganizationsIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create UCSBOrganizations/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ObjectLiteral
main/pages/UCSBOrganizations/UCSBOrganizationsIndexPage.js:28:28
                 <Button
                     variant="primary"
                     href="/UCSBOrganizations/create"
-                    style={{ float: "right" }}
+                    style={{}}
                 >
                     Create UCSBOrganizations
killedBy: UCSBOrganizationsIndexPage tests Renders with Create Button for admin user
statusReason: Error: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null
