[Killed] BlockStatement
src/main/utils/UCSBOrganizationsUtils.js:8:47
     toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-    return {
-        url: "/api/UCSBOrganizations",
-        method: "DELETE",
-        params: {
-            orgCode: cell.row.values.orgCode
-        }
-    }
-}
+export function cellToAxiosParamsDelete(cell) {}
 
 
killedBy: UCSBOrganizationsIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSBOrganizations with orgCode ZPR was deleted"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] StringLiteral
src/main/utils/UCSBOrganizationsUtils.js:10:14
 
 export function cellToAxiosParamsDelete(cell) {
     return {
-        url: "/api/UCSBOrganizations",
+        url: "",
         method: "DELETE",
         params: {
killedBy: UCSBOrganizationsIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSBOrganizations with orgCode ZPR was deleted"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] StringLiteral
src/main/utils/UCSBOrganizationsUtils.js:11:17
 export function cellToAxiosParamsDelete(cell) {
     return {
         url: "/api/UCSBOrganizations",
-        method: "DELETE",
+        method: "",
         params: {
             orgCode: cell.row.values.orgCode
killedBy: UCSBOrganizationsIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSBOrganizations with orgCode ZPR was deleted"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2
