[Killed] ConditionalExpression
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:35:18
 
             <Row>
 
-                {initialContents && (
-                    <Col>
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">Id</Form.Label>
-                            <Form.Control
-                                data-testid="UCSBMenuItemForm-id"
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialContents.id}
-                                disabled
-                            />
-                        </Form.Group>
-                    </Col>
-                )}
+                {false}
 
                 <Col>
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBMenuItemForm-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:59:63
                             id="diningCommonsCode"
                             type="text"
                             isInvalid={Boolean(errors.name)}
-                            {...register("diningCommonsCode", {
-                                required: "Dining Common Code is required."
-                            })}
+                            {...register("diningCommonsCode", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: UCSBMenuItemForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /Dining Common Code is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:76:50
                             id="name"
                             type="text"
                             isInvalid={Boolean(errors.name)}
-                            {...register("name", {
-                                required: "Dish Name is required."
-                            })}
+                            {...register("name", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: UCSBMenuItemForm tests Correct Error messsages on missing input
statusReason: TypeError: e is not a function
