[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.js:51:71
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
         columns.push(ButtonColumn("Edit", "primary", editCallback, "UCSBMenuItemsTable"));
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, "UCSBMenuItemsTable"));
+        columns.push(ButtonColumn("Delete", "danger", deleteCallback, ""));
     } 
 
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBMenuItemsTable-cell-row-0-col-Delete-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.js:57:17
     return <OurTable
         data={menuItems}
         columns={columns}
-        testid={"UCSBMenuItemsTable"}
+        testid={""}
     />;
 };
killedBy: UCSBDiningCommonsMenuItemIndexPage tests renders three dates correctly for regular user
statusReason: Error: Unable to find an element by: [data-testid="UCSBMenuItemsTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
