[Killed] ArrowFunction
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.js:9:31
 
 export default function UCSBDiningCommonsMenuItemCreatePage({storybook=false}) {
 
-  const objectToAxiosParams = (ucsbMenuItem) => ({
-    url: "/api/ucsbmenuitems/post",
-    method: "POST",
-    params: {
-      diningCommonsCode: ucsbMenuItem.diningCommonsCode,
-      name: ucsbMenuItem.name,
-      station: ucsbMenuItem.station
-    }
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (ucsbMenuItem) => {
killedBy: UCSBDiningCommonsMenuItemCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.js:11:13
 
   const objectToAxiosParams = (ucsbMenuItem) => ({
     url: "/api/ucsbmenuitems/post",
-    method: "POST",
+    method: "",
     params: {
       diningCommonsCode: ucsbMenuItem.diningCommonsCode,
killedBy: UCSBDiningCommonsMenuItemCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.js:12:13
   const objectToAxiosParams = (ucsbMenuItem) => ({
     url: "/api/ucsbmenuitems/post",
     method: "POST",
-    params: {
-      diningCommonsCode: ucsbMenuItem.diningCommonsCode,
-      name: ucsbMenuItem.name,
-      station: ucsbMenuItem.station
-    }
+    params: {}
   });
 
killedBy: UCSBDiningCommonsMenuItemCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Object {
-   "diningCommonsCode": "ortega",
-   "name": "Baked Pesto Pasta with Chicken",

[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.js:19:39
     }
   });
 
-  const onSuccess = (ucsbMenuItem) => {
-    toast(`New ucsbMenuItem Created - id: ${ucsbMenuItem.id} name: ${ucsbMenuItem.name}`);
-  }
+  const onSuccess = (ucsbMenuItem) => {}
 
   const mutation = useBackendMutation(
killedBy: UCSBDiningCommonsMenuItemCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New ucsbMenuItem Created - id: 17 name: Baked Pesto Pasta with Chicken"

Number of calls: 0
