[Killed] ObjectLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.js:18:17
       {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
         method: "GET",
         url: `/api/ucsbmenuitems`,
-        params: {
-          id
-        }
+        params: {}
       }
     );
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="UCSBMenuItemForm-diningCommonsCode"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.js:25:34
     );
 
 
-  const objectToAxiosPutParams = (ucsbMenuItem) => ({
-    url: "/api/ucsbmenuitems",
-    method: "PUT",
-    params: {
-      id: ucsbMenuItem.id,
-    },
-    data: {
-      diningCommonsCode: ucsbMenuItem.diningCommonsCode,
-      name: ucsbMenuItem.name,
-      station: ucsbMenuItem.station
-    }
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (ucsbMenuItem) => {
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSBDiningCommonsMenuItem Updated - id: 17 name: Grilled Turkey Cheddar Sandwich"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.js:38:39
     }
   });
 
-  const onSuccess = (ucsbMenuItem) => {
-    toast(`UCSBDiningCommonsMenuItem Updated - id: ${ucsbMenuItem.id} name: ${ucsbMenuItem.name}`);
-  }
+  const onSuccess = (ucsbMenuItem) => {}
 
   const mutation = useBackendMutation(
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.js:55:32
     mutation.mutate(data);
   }
 
-  if (isSuccess && !storybook) {
-    return <Navigate to="/ucsbmenuitems" />
-  }
+  if (isSuccess && !storybook) {}
 
   return (
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/ucsbmenuitems"}

Number of calls: 0

[Killed] ConditionalExpression
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.js:64:11
       <div className="pt-2">
         <h1>Edit UCSBDiningCommonsMenuItem</h1>
         {
-          ucsbMenuItem && <UCSBMenuItemForm initialContents={ucsbMenuItem} submitAction={onSubmit} buttonLabel="Update" />
+          false
         }
       </div>
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="UCSBMenuItemForm-diningCommonsCode"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] LogicalOperator
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.js:64:11
       <div className="pt-2">
         <h1>Edit UCSBDiningCommonsMenuItem</h1>
         {
-          ucsbMenuItem && <UCSBMenuItemForm initialContents={ucsbMenuItem} submitAction={onSubmit} buttonLabel="Update" />
+          ucsbMenuItem || <UCSBMenuItemForm initialContents={ucsbMenuItem} submitAction={onSubmit} buttonLabel="Update" />
         }
       </div>
killedBy: UCSBDiningCommonsMenuItemEditPage tests when the backend doesn't return data renders header but table is not present
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input class="form-control" data-testid="UCSBMenuItemForm-diningCommonsCode" id="diningCommonsCode" name="diningCommonsCode" type="text" /> instead
