[Killed] BlockStatement
main/pages/Articles/ArticlesCreatePage.js:21:35
     }
   });
 
-  const onSuccess = (articles) => {
-    toast(`New articles created - id: ${articles.id} title: ${articles.title}`);
-  }
+  const onSuccess = (articles) => {}
 
   const mutation = useBackendMutation(
killedBy: ArticlesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New articles created - id: 2003 title: My Article"

Number of calls: 0
