[Killed] ArrowFunction
main/pages/Articles/ArticlesEditPage.js:25:34
     );
 
 
-  const objectToAxiosPutParams = (articles) => ({
-    url: "/api/articles",
-    method: "PUT",
-    params: {
-      id: articles.id,
-    },
-    data: {
-      title: articles.title,
-      url: articles.url,
-      explanation: articles.explanation,
-      email: articles.email,
-      dateAdded: articles.dateAdded
-    }
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (articles) => {
killedBy: ArticlesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Articles Updated - id: 2003 title: Article II"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] BlockStatement
main/pages/Articles/ArticlesEditPage.js:40:35
     }
   });
 
-  const onSuccess = (articles) => {
-    toast(`Articles Updated - id: ${articles.id} title: ${articles.title}`);
-  }
+  const onSuccess = (articles) => {}
 
   const mutation = useBackendMutation(
killedBy: ArticlesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] LogicalOperator
main/pages/Articles/ArticlesEditPage.js:66:11
       <div className="pt-2">
         <h1>Edit Articles</h1>
         {
-          articles && <ArticlesForm initialContents={articles} submitAction={onSubmit} buttonLabel="Update" />
+          articles || <ArticlesForm initialContents={articles} submitAction={onSubmit} buttonLabel="Update" />
         }
       </div>
killedBy: ArticlesEditPage tests when the backend doesn't return data renders header but table is not present
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input class="form-control" data-testid="ArticlesForm-title" id="title" name="title" type="text" /> instead

[Killed] ConditionalExpression
main/pages/Articles/ArticlesEditPage.js:66:11
       <div className="pt-2">
         <h1>Edit Articles</h1>
         {
-          articles && <ArticlesForm initialContents={articles} submitAction={onSubmit} buttonLabel="Update" />
+          false
         }
       </div>
killedBy: ArticlesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="ArticlesForm-title"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
