[Killed] BlockStatement
main/pages/Articles/ArticlesIndexPage.js:14:45
   const currentUser = useCurrentUser();
 
   const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-        return (
-            <Button
-                variant="primary"
-                href="/articles/create"
-                style={{ float: "right" }}
-            >
-                Create Articles 
-            </Button>
-        )
-    } 
+    if (hasRole(currentUser, "ROLE_ADMIN")) {} 
   }
   
killedBy: ArticlesIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create Articles/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
